<a href="https://colab.research.google.com/github/Praxis-QR/RDWH/blob/main/Public_MySQL_Server_in_Google_Colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text](https://github.com/Praxis-QR/RDWH/raw/main/images/YantraJaalBanner.png)<br>


<hr>

[Prithwis Mukerjee](http://www.linkedin.com/in/prithwis)<br>

#Objective
In this Notebook, we install a MySQL Database on the Google Colab Platform and then make it visible on the public internet using NGROK Tunnels

In [1]:
from datetime import datetime
import pytz
print('ॐ श्री सरस्वत्यै नमः',datetime.now(pytz.timezone('Asia/Calcutta')))
!python --version
!lsb_release -a

ॐ श्री सरस्वत्यै नमः 2023-09-20 11:18:46.820695+05:30
Python 3.10.12
No LSB modules are available.
Distributor ID:	Ubuntu
Description:	Ubuntu 22.04.2 LTS
Release:	22.04
Codename:	jammy

#Create Local MySQL Database

## Install MySQL

In [2]:
!apt update > /dev/null
!apt install -y  mysql-server > /dev/null
!/etc/init.d/mysql restart
!mysql --version
!mysql -e 'create database praxisDB'
#!mysql -e 'show databases'

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.


WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
su: warning: cannot change directory to /nonexistent: No such file or directory
   ...done.
mysql  Ver 8.0.34-0ubuntu0.22.04.1 for Linux on x86_64 ((Ubuntu))

## Pythons Functions for MySQL Access

In [3]:
!apt install libmysqlclient-dev > /dev/null
!pip install mysqlclient > /dev/null
import pandas as pd
import MySQLdb
from sqlalchemy import create_engine, text

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

In [4]:
#To run any non-SELECT SQL command
def runCMD (engine, DDL):
    DBConn = engine.connect()
    retcode = DBConn.execute(text(DDL))
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command and return result set in pandas dataframe
def runSELECT (engine, CMD):
    DBConn = engine.connect()
    df_mysql = pd.read_sql(text(CMD), con=DBConn)
    DBConn.close()
    return df_mysql

## Testing Local Access

In [5]:
connect_string = 'mysql://root@localhost/praxisDB'
local_engine = create_engine(connect_string)

In [6]:
DBConn = local_engine.connect()
cursor = DBConn.execute(text("SELECT VERSION()"))

# Fetch a single row using fetchone() method.
data = cursor.fetchone()
print ("Database version ", data)
# disconnect from server
DBConn.close()

Database version  ('8.0.34-0ubuntu0.22.04.1',)

In [7]:
# Create and load Emp table
# -----------------------------
runCMD(local_engine,"DROP TABLE IF EXISTS Emp;")
# -----------------------------
runCMD(local_engine,"CREATE TABLE IF NOT EXISTS Emp (\
  EmpID char(6)  NOT NULL,\
  LastName varchar(50),\
  FirstName varchar(50),\
  JobDesc varchar(50),\
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
# -----------------------------
runCMD(local_engine,"INSERT INTO Emp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

In [8]:
# Create and load DEPT table
# --------------------------------
runCMD(local_engine,"DROP TABLE IF EXISTS Dept;")
# --------------------------------
runCMD(local_engine,"CREATE TABLE Dept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
# --------------------------------
runCMD(local_engine,"INSERT INTO Dept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

In [9]:
# Check the data
# -------------------------------
runSELECT(local_engine,"select * from Emp, Dept where Emp.DeptID = Dept.DeptID")

,EmpID,LastName,FirstName,JobDesc,JoinDate,Salary,Comm,DeptID,DeptID,DeptName,ManagerID,Location
0,742866,Bacchan,Amitabh,Executive,2003-03-10,50000,0.10,10,10,Corporate,299034,Calcutta
1,349870,Mukherjee,Rani,Manager,2005-05-04,25000,0.06,40,40,Production,349870,Bombay
2,865477,Dikshit,Madhuri,Clerk,2002-04-04,10000,0.02,20,20,Sales,239456,Calcutta
3,239456,Khan,Shahrukh,Manager,2004-01-03,30000,0.07,20,20,Sales,239456,Calcutta
4,897889,Sehwag,Virender,Cus_Rep,2005-01-02,15000,0.05,20,20,Sales,239456,Calcutta
5,123980,Dhoni,Mahender,Clerk,2004-10-09,9000,0.02,40,40,Production,349870,Bombay
6,822134,Dravid,Rahul,Sr Manager,2000-06-04,40000,0.08,30,30,Accounts,822134,Calcutta
7,997445,Dalmia,Jagmohan,Clerk,2001-07-01,12000,0.02,30,30,Accounts,822134,Calcutta
8,989007,Ganguly,Sourav,Cus_Rep,2002-01-01,20000,0.03,40,40,Production,349870,Bombay
9,299034,Ganesan,Rekha,Director,2002-10-10,60000,0.11,10,10,Corporate,299034,Calcutta
10,546223,Karthikeyan,Narayan,Secretary,2005-12-04,40000,0.09,10,10,Corporate,299034,Calcutta
11,223112,Mirza,Sania,Cus_Rep,2001-11-19,25000,0.04,30,30,Accounts,822134,Calcutta

#Modifications for Remote Access <br>
https://phoenixnap.com/kb/mysql-remote-connection <br>
https://www.techrepublic.com/article/create-mysql-8-database-user-remote-access-databases/

## Modify mysqld.cnf file

In [10]:
# Here is the original mysqld.cnf file
#!cat /etc/mysql/mysql.conf.d/mysqld.cnf

In [ ]:
# This one line needs to be changed
!sed 's/bind-address		= 127.0.0.1/bind-address		= 0.0.0.0/g' /etc/mysql/mysql.conf.d/mysqld.cnf > mysqld_mod.cnf

In [11]:
# overwrite the original file with the modified file
# then restate MySQL
#
!cp /content/mysqld_mod.cnf /etc/mysql/mysql.conf.d/mysqld.cnf
!/etc/init.d/mysql restart
#!mysql -e 'show databases'

cp: cannot stat '/content/mysqld_mod.cnf': No such file or directory
 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
su: warning: cannot change directory to /nonexistent: No such file or directory
   ...done.

## Creating Multiple Remote Users, Passwords, Databases

In [13]:
# IF this command fails once with
# OperationalError: (MySQLdb.OperationalError) (2013, 'Lost connection to MySQL server during query')
# Try again
#
for userID in range(10,12):
    #print(userID)
    cDBCmd = "create database db4user"+str(userID)
    cUserCmd = "create user 'rUser"+str(userID)+"'@'%' identified by 'pw4rUser"+str(userID)+"';"
    grantCmd = "grant all on db4user"+str(userID)+".* to 'rUser"+str(userID)+"'@'%';"
    print('Create database command : ',cDBCmd)
    print('Create user command : ',cUserCmd)
    print('Grant access to user command :',grantCmd)
    runCMD(local_engine,cDBCmd)
    runCMD(local_engine, cUserCmd)
    runCMD(local_engine, grantCmd)

Create database command :  create database db4user10
Create user command :  create user 'rUser10'@'%' identified by 'pw4rUser10';
Grant access to user command : grant all on db4user10.* to 'rUser10'@'%';
Create database command :  create database db4user11
Create user command :  create user 'rUser11'@'%' identified by 'pw4rUser11';
Grant access to user command : grant all on db4user11.* to 'rUser11'@'%';

In [14]:
!mysql -e 'show databases'

+--------------------+
| Database           |
+--------------------+
| db4user10          |
| db4user11          |
| information_schema |
| mysql              |
| performance_schema |
| praxisDB           |
| sys                |
+--------------------+

In [15]:
!mysql -e 'SELECT user FROM mysql.user;'

+------------------+
| user             |
+------------------+
| rUser10          |
| rUser11          |
| debian-sys-maint |
| mysql.infoschema |
| mysql.session    |
| mysql.sys        |
| root             |
+------------------+

# NGROK Tunnel
Since the 3306 port of the Google Colab VM, the localhost' is not accessible from the public internet, we would need to set up a tunnel from the port to the a public URL <br>
https://danielmiessler.com/study/ngrok/ <br>
token is available at https://dashboard.ngrok.com/get-started/setup

In [16]:
from google.colab import drive
drive.mount('/content/drive')

!cp /content/drive/'My Drive'/Praxis/WebCredentials/ngrokToken.py .
# credential file for Prithwis Mukerjee
# this file needs to be uploaded into the VM

from ngrokToken import ngrokToken

#for the sake of privacy
#the following credentials need to be stored in a text file called ngrokToken.py


#otherwise, the values can be directly placed here

#ngrokToken = 'xxxxxxxxxxxxxxx'   # uncomment this line and place your own credentials here
#token is available at https://dashboard.ngrok.com/get-started/setup


#print(ngrokToken)
ngrokTokenCmd = 'ngrok authtoken '+ngrokToken

Mounted at /content/drive

### ngrok wrapper

In [17]:
!pip -q install pyngrok

from pyngrok import ngrok
# you may place the token directly here
#!ngrok authtoken xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
get_ipython().system_raw(ngrokTokenCmd)

# Open a HTTP tunnel on the default port 80
#public_url = ngrok.connect(port = '4050')
#public_url = ngrok.connect(3306)

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 698.8/698.8 kB 5.2 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
  Building wheel for pyngrok (setup.py) ... done

In [ ]:
#!mkdir /root/.config/ngrok
#!mv /root/.ngrok2/ngrok.yml /root/.config/ngrok/ngrok.yml

In [ ]:
#!mv /root/.ngrok2/ngrok.yml /root/.config/ngrok/ngrok.yml

In [ ]:
#!rm /root/.ngrok2/ngrok.yml
#!ls /root/.config/ngrok/

ngrok.yml

In [18]:
!ls /root/.config/ngrok/

ls: cannot access '/root/.config/ngrok/': No such file or directory

In [19]:
tcp_tunnel = ngrok.connect(3306, "tcp")
tcp_tunnel
tHost = str(tcp_tunnel)[20:40]
print('Tunnel to MySQL is at ',tHost)

WARNING:pyngrok.process.ngrok:t=2023-09-20T06:01:40+0000 lvl=warn msg="ngrok config file found at legacy location, move to XDG location" xdg_path=/root/.config/ngrok/ngrok.yml legacy_path=/root/.ngrok2/ngrok.yml

Tunnel to MySQL is at  2.tcp.ngrok.io:17168

In [ ]:
#!curl -s http://localhost:4040/api/tunnels

In [ ]:
#disConnectURL = 'tcp://'+tHost
# Incase we need to disconnect the ngrok tunnel, uncomment and execute the line below
#ngrok.disconnect(disConnectURL)

## Connecting Remotely through Tunnel

In [20]:
# Use hostname, port from ngrok output
#
#remote_connect_string = 'mysql://'+'rUser10'+':'+'pw4rUser10'+'@'+'0.tcp.ngrok.io:11657'+'/'+'db4user10'

userid = 'rUser10'                      # or any other user with remote access
password = 'pw4rUser10'                 # password of user
dbname = 'db4user10'                    # database name to which this user has access
hostname = str(tcp_tunnel)[20:40]       # from ngrok tunnel

remote_connect_string = 'mysql://'+userid+':'+password+'@'+tHost+'/'+dbname
print(remote_connect_string)
remote_engine = create_engine(remote_connect_string)

mysql://rUser10:pw4rUser10@2.tcp.ngrok.io:17168/db4user10

In [21]:
DBConn = remote_engine.connect()
cursor = DBConn.execute(text("SELECT VERSION()"))

# Fetch a single row using fetchone() method.
data = cursor.fetchone()
print ("Database version ", data)
# disconnect from server
DBConn.close()

Database version  ('8.0.34-0ubuntu0.22.04.1',)

#Remote Access

In [22]:
# Create and load Emp table
# -----------------------------
runCMD(remote_engine,"DROP TABLE IF EXISTS rEmp;")
# -----------------------------
runCMD(remote_engine,"CREATE TABLE IF NOT EXISTS rEmp (\
  EmpID char(6)  NOT NULL,\
  LastName varchar(50),\
  FirstName varchar(50),\
  JobDesc varchar(50),\
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
# -----------------------------
runCMD(remote_engine,"INSERT INTO rEmp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

In [23]:
# Create and load DEPT table
# --------------------------------
runCMD(remote_engine,"DROP TABLE IF EXISTS rDept;")
# --------------------------------
runCMD(remote_engine,"CREATE TABLE rDept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
# --------------------------------
runCMD(remote_engine,"INSERT INTO rDept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

In [25]:
# Check the data
# -------------------------------
runSELECT(remote_engine,"select * from rEmp, rDept where rEmp.DeptID = rDept.DeptID")

,EmpID,LastName,FirstName,JobDesc,JoinDate,Salary,Comm,DeptID,DeptID,DeptName,ManagerID,Location
0,742866,Bacchan,Amitabh,Executive,2003-03-10,50000,0.10,10,10,Corporate,299034,Calcutta
1,349870,Mukherjee,Rani,Manager,2005-05-04,25000,0.06,40,40,Production,349870,Bombay
2,865477,Dikshit,Madhuri,Clerk,2002-04-04,10000,0.02,20,20,Sales,239456,Calcutta
3,239456,Khan,Shahrukh,Manager,2004-01-03,30000,0.07,20,20,Sales,239456,Calcutta
4,897889,Sehwag,Virender,Cus_Rep,2005-01-02,15000,0.05,20,20,Sales,239456,Calcutta
5,123980,Dhoni,Mahender,Clerk,2004-10-09,9000,0.02,40,40,Production,349870,Bombay
6,822134,Dravid,Rahul,Sr Manager,2000-06-04,40000,0.08,30,30,Accounts,822134,Calcutta
7,997445,Dalmia,Jagmohan,Clerk,2001-07-01,12000,0.02,30,30,Accounts,822134,Calcutta
8,989007,Ganguly,Sourav,Cus_Rep,2002-01-01,20000,0.03,40,40,Production,349870,Bombay
9,299034,Ganesan,Rekha,Director,2002-10-10,60000,0.11,10,10,Corporate,299034,Calcutta
10,546223,Karthikeyan,Narayan,Secretary,2005-12-04,40000,0.09,10,10,Corporate,299034,Calcutta
11,223112,Mirza,Sania,Cus_Rep,2001-11-19,25000,0.04,30,30,Accounts,822134,Calcutta

# Disconnect Tunnel

In [26]:
disConnectURL = 'tcp://'+tHost
# Incase we need to disconnect the ngrok tunnel, uncomment and execute the line below
ngrok.disconnect(disConnectURL)

In [27]:
print('Tested : ',datetime.now(pytz.timezone('Asia/Calcutta')))

Tested :  2023-09-20 11:54:56.780108+05:30

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself.
If you have an interest in AI and found this material useful, you may consider buying these novels, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)